CSI API ETABS v1

# cAreaObjGetSelectedEdge Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetSelectedEdge(
    	string Name,
    	ref int NumberEdges,
    	ref bool[] Selected
    )

    Function GetSelectedEdge (
    	Name As String,
    	ByRef NumberEdges As Integer,
    	ByRef Selected As Boolean()
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim NumberEdges As Integer
    Dim Selected As Boolean()
    Dim returnValue As Integer

    returnValue = instance.GetSelectedEdge(Name,
    	NumberEdges, Selected)

    int GetSelectedEdge(
    	String^ Name,
    	int% NumberEdges,
    	array<bool>^% Selected
    )

    abstract GetSelectedEdge :
            Name : string *
            NumberEdges : int byref *
            Selected : bool[] byref -> int

#### Parameters

Name

    Type: SystemString

NumberEdges

    Type: SystemInt32

Selected

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com